Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/extra_social_welfare_benefits/additional_social_welfare_benefits.html.txt.tmx
Source language: en
Languages: ga

source: Extra social welfare benefits
ga: Sochair bhreise leasa shóisialaigh

source: If you are getting a social assistance payment or a social insurance payment from the Department of Social Protection you may be entitled to additional or extra benefits depending on your personal circumstances
ga: Má tá tú ag fáil íocaíocht leasa shóisialaigh nó íocaíocht árachais shóisialta ón Roinn Coimirce Sóisialaí, b’fhéidir, ag brath ar do chúinsí pearsanta, go mbeifeá i dteideal sochair bhreise a fháil

source: In some cases, you can get a benefit even if you are not getting a social welfare payment
ga: Chun sochar breise a fháil, ní mór duit na critéir cháilíochta a shásamh

source: For example, everyone over 66 is entitled to a Free Travel Pass
ga: Mar shampla, le go bhfaighfeá an Méadú do Chónaí Aonair, ní mór duit íocaíocht áirithe leasa shóisialaigh a fháil agus bheith i do chónaí i d’aonar

source: To get an extra benefit you must satisfy the qualifying criteria
ga: I roinnt cásanna, gheobhaidh tú sochar breise go huathoibríoch

source: For example, to get the Living Alone Increase you must be getting a certain social welfare payment and be living alone
ga: Mar shampla, má fhaigheann tú Pinsean Míchumais, gheobhaidh tú Pas Taistil Saor in Aisce

source: In some cases you automatically get an additional benefit. For example, if you get Invalidity Pension you automatically get a Free Travel Pass
ga: Ní foláir duit iarratas ar leith a dhéanamh le haghaidh gach sochair, áfach, chun go bhfaighfeá formhór na sochar breise

source: You may be entitled to the following additional social welfare benefits:
ga: Má tá íocaíocht leasa shóisialaigh á fáil agat, b’fhéidir go mbeifeá i dteideal na sochair bhreise leasa shóisialaigh seo a leanas a fháil:

source: Fuel Allowance is an allowance that provides help with the cost of fuel to people who are dependant on long-term social welfare payments
ga: Méadú do Chónaí Aonair. Is íocaíocht fhorlíontach í do dhaoine atá ag fáil íocaíochtaí áirithe leasa shóisialaigh agus atá ina gcónaí ina n-aonar

source: Household Benefits Package is a package of benefits that provides financial assistance with the cost of some household utilities
ga: Pacáiste Sochar Teaghlaigh Seo pacáiste sochar a thugann cúnamh airgid maidir le costas fóntais áirithe teaghlaigh

source: It includes an Electricity or Gas Allowance and a Free Television Licence
ga: Áirítear ann Liúntas Leictreachais nó Gáis agus Ceadúnas Teilifíse Saor in Aisce

source: Supplementary Welfare Allowance Scheme consists of a basic payment, called Supplementary Welfare Allowance, and other financial supplements for certain expenses you may not be able to meet, including emergency situations
ga: Pas Taistil Saor in Aisce Ceadaíonn sé seo do dhaoine atá ag fáil íocaíochtaí áirithe leasa shóisialaigh seirbhísí iompair phoiblí a rochtain saor in aisce

source: These include Rent Supplement, Back to School Clothing and Footwear Allowance, and Heating Supplements
ga: Má tá tú i do chónaí ar oileán sonrach amach ó chósta na hÉireann, tig leat seirbhísí príobháideacha iompair áirithe a rochtain

source: Free Travel Pass allows people on certain social welfare payments to access public transport services for free. If you live on a specified island off the Irish coast you can access certain private transport services
ga: Liúntas Breosla Is liúntas é seo a thugann cabhair maidir le costas breosla do dhaoine atá ag brath ar íocaíochtaí fadtréimhseacha leasa shóisialaigh

source: Living Alone Increase is a supplementary payment for people getting certain social welfare payments who are living alone
ga: Méadú Oileáin Is íocaíocht fhorlíontach í seo le haghaidh daoine atá ag fáil íocaíochtaí áirithe leasa shóisialaigh agus atá ina gcónaí ar oileáin shonracha amach ó chósta na hÉireann

source: Island Increase is a supplementary payment for people getting certain social welfare payments and living on specified islands off the coast of Ireland
ga: Ina measc seo tá Fordheontas ar Cíosa, Liúntas Éadaí & Coisbhirt don Scoilbhliain Nua, Fordheontas Aiste Bia agus Fordheontas Teasa
